# BASICS OF DATA
<hr>

# 1. CREATE SIMPLE DATA

## 1.1 CREATING DATA FRAMES

In [15]:
import pandas as pd

# data
data = {
    "name" : ["Adam", "Betty", "Celiwe", "Delani"],
    "age" : [18, 19, 24, 30]
}

# Loads data into dataframe
df = pd.DataFrame(data)

# View the data
print(df)

     name  age
0    Adam   18
1   Betty   19
2  Celiwe   24
3  Delani   30

In [17]:
# print by row index
print(df.loc[0])

name    Adam
age       18
Name: 0, dtype: object

# 2. IMPORT DATA 
<hr>

## 2.1 IMPORT FROM CSV FILE

In [12]:
# import pandas
import pandas as pd

data = pd.read_csv('Data/Subscription Cohort Analysis Data.csv')

# print(data)
data.head()

,customer_id,created_date,canceled_date,subscription_cost,subscription_interval,was_subscription_paid
0,154536156,2022-09-01,NaN,39,month,Yes
1,149713408,2022-09-01,2022-09-02,39,month,No
2,153756284,2022-09-01,2022-09-02,39,month,No
3,121253113,2022-09-01,2022-09-23,39,month,Yes
4,154467210,2022-09-01,2023-06-29,39,month,Yes